tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-versions"
tap "homebrew/core"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Modern replacement for 'ls'
brew "exa"
# User-friendly cURL replacement (command-line HTTP client)
brew "httpie"
# Mac App Store command-line interface
brew "mas"
# Platform built on V8 to build network applications
brew "node", link: false
# Manage multiple Node.js versions
brew "nvm"
# UNIX shell (command interpreter)
brew "zsh"
# Photo editing and graphic design software
cask "affinity-designer-beta"
# Application launcher and productivity software
cask "alfred"
# Voice and text chat software
cask "discord"
# Client for the Dropbox cloud storage service
cask "dropbox"
# Password manager that syncs across devices
cask "dropbox-passwords"
# Collaborative team software
cask "figma"
# Web browser
cask "firefox"
# Web browser
cask "firefox-developer-edition"
# Web browser
cask "firefox-nightly"
# Web browser
cask "google-chrome"
# Web browser
cask "google-chrome-canary"
# Terminal emulator as alternative to Apple's Terminal app
cask "iterm2"
# Provides updates to various Microsoft products
cask "microsoft-auto-update"
# Multi-platform web browser
cask "microsoft-edge"
# Multi-platform web browser
cask "microsoft-edge-dev"
# Music streaming service
cask "spotify"
# VPN client for secure internet access and private browsing
cask "tunnelbear"
# Open-source code editor
cask "visual-studio-code"
# Code editor
cask "visual-studio-code-insiders"
mas "Bear", id: 1091189122
mas "Clean", id: 418412301
mas "GIPHY CAPTURE", id: 668208984
mas "Magnet", id: 441258766
mas "Tomato One", id: 907364780
