tap "dart-lang/dart"
tap "eth-p/software"
tap "homebrew/bundle"
tap "homebrew/cask-versions"
tap "homebrew/services"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Pack, ship and run any application as a lightweight container
brew "docker"
# Modern, maintained replacement for ls
brew "eza"
# Distributed revision control system
brew "git"
# Apache HTTP server
brew "httpd"
# User-friendly cURL replacement (command-line HTTP client)
brew "httpie"
# Mac App Store command-line interface
brew "mas"
# Protocol buffers (Google's data interchange format)
brew "protobuf@21"
# Open source relational database management system
brew "mysql"
# HTTP/2 C Library
brew "nghttp2"
# Platform built on V8 to build network applications
brew "node"
# Manage multiple Node.js versions
brew "nvm"
# Code formatter for JavaScript, CSS, JSON, GraphQL, Markdown, YAML
brew "prettier"
# Interpreted, interactive, object-oriented programming language
brew "python@3.11"
# Interpreted, interactive, object-oriented programming language
brew "python@3.9"
# JavaScript package manager
brew "yarn"
# UNIX shell (command interpreter)
brew "zsh"
# Bash scripts that integrate bat with various command-line tools
brew "eth-p/software/bat-extras"
# Professional graphic design software
cask "affinity-designer"
# Application launcher and productivity software
cask "alfred"
# Server and cloud storage browser
cask "cyberduck"
# Voice and text chat software
cask "discord"
# App to build and share containerized applications and microservices
cask "docker"
# Client for the Dropbox cloud storage service
cask "dropbox"
# Collaborative team software
cask "figma"
# Web browser
cask "firefox"
# Web browser
cask "firefox-developer-edition"
# Web browser
cask "firefox-nightly"
# Web browser
cask "google-chrome"
# Web browser
cask "google-chrome-canary"
# Open-source Markdown editor
cask "macdown"
# Provides updates to various Microsoft products
cask "microsoft-auto-update"
# Web browser
cask "microsoft-edge"
# App to write, plan, collaborate, and get organized
cask "notion"
# Knowledge base that works on top of a local folder of plain text Markdown files
cask "obsidian"
# Music streaming service
cask "spotify"
# Git client focusing on power and productivity
cask "tower"
# VPN client for secure internet access and private browsing
cask "tunnelbear"
# Tool to hide menu bar icons
cask "vanilla"
# Open-source code editor
cask "visual-studio-code"
mas "Bear", id: 1091189122
mas "Clean", id: 418412301
mas "GarageBand", id: 682658836
mas "GIPHY CAPTURE", id: 668208984
mas "Magnet", id: 441258766
mas "Microsoft OneNote", id: 784801555
mas "Microsoft To Do", id: 1274495053
mas "Things", id: 904280696
mas "Tomato One", id: 907364780
mas "‎WhatsApp", id: 310633997
vscode "astro-build.astro-vscode"
vscode "dbaeumer.vscode-eslint"
vscode "Equinusocio.vsc-material-theme"
vscode "equinusocio.vsc-material-theme-icons"
vscode "esbenp.prettier-vscode"
vscode "formulahendry.auto-rename-tag"
vscode "GitHub.github-vscode-theme"
vscode "luwenjiechn.nunjucks-vscode-snippets"
vscode "phoenisx.cssvar"
vscode "PKief.material-icon-theme"
vscode "pushqrdx.inline-html"
vscode "ritwickdey.LiveServer"
vscode "vangware.dark-plus-material"
vscode "vincaslt.highlight-matching-tag"
vscode "vscode-icons-team.vscode-icons"
vscode "yzhang.markdown-all-in-one"
